# Напишите программу, которая запрашивает у пользователя имя и фамилию и выводит на экран
# сообщение
# Имя Фамилия , добро пожаловать!

name = input("Введите имя: ")
surname = input("Введите фамилию: ")

print(name, surname, "Добро пожаловать!")

