# В списке age сохранены значения возраста респондентов:
# Создайте список age2, в котором будут храниться значения возраста, возведенные в квадрат.

age = [24, 35, 42, 27, 45, 48, 33]

age2 = []

for k in age:
    age2.append(k*k)
print(age2)

